$using list$

In [2]:
names=['ram','sita','laxman']
age=[25,22,20]

In [3]:
import pandas as pd

In [4]:
pd.DataFrame(data=zip(names,age))

        0   1
0     ram  25
1    sita  22
2  laxman  20

In [5]:
pd.DataFrame(data=zip(names,age),columns=['names','age'])

    names  age
0     ram   25
1    sita   22
2  laxman   20

In [6]:
pd.DataFrame(data=zip(names,age),columns=['names','age'],index=['A','B','C'])

    names  age
A     ram   25
B    sita   22
C  laxman   20

In [7]:
data1=pd.DataFrame(data=zip(names,age),columns=['names','age'],index=['A','B','C'])

In [9]:
data1

    names  age
A     ram   25
B    sita   22
C  laxman   20

In [11]:
data1.to_csv("C:\\Users\\Administrator\\OneDrive\\Desktop\\data science\\sample1.csv")

$using dictionary$

In [12]:
dict1={"Names":['ram','sita','laxman'],
      "age":[25,22,20]}
dict1

{'Names': ['ram', 'sita', 'laxman'], 'age': [25, 22, 20]}

In [16]:
data2=pd.DataFrame(dict1)#keys are default columns
data2

    Names  age
0     ram   25
1    sita   22
2  laxman   20

In [17]:
data2.to_csv("C:\\Users\\Administrator\\OneDrive\\Desktop\\data science\\sample2.csv")

In [19]:
import os
os.getcwd()

'C:\\Users\\Administrator\\OneDrive\\Desktop\\data science'